//Напишите программу, которая на вход принимает два целых числа
//и проверяет, явдяется ли первое число квадратом второго.

int a = 25;
int b = 5;
if (b * b == a)
Console.WriteLine("да");
else
Console.WriteLine("нет");