// Напишите программу, которая на входе принимает целое число N,
// а на выходе показывает все целые числа в промежутке от -N до N. 

int a = 7;
int i = -a;
while(i <= a)
{
    Console.Write(i + " ");
    i++;
}

