//Напишите программу, которая принимает на вход трехзначное число
// и на выходе показывает сумму первой и последней цифры этого числа.

int a = 567;
Console.WriteLine(a % 10 + a / 100);

